app/views/movies/show.html.erb


      <%= link_to "Comments (#{review.comments.count})", movie_review_path(@movie, review) %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."review_id" = $1  [["review_id", 2]]